In [1]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\shrut\anaconda3\lib\site-packages (1.4.22)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\shrut\anaconda3\lib\site-packages (from sqlalchemy) (1.1.1)

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\shrut\anaconda3\lib\site-packages (1.0.2)

In [3]:
import sqlalchemy # install if needed
from sqlalchemy import create_engine

In [4]:
import pandas as pd
import pymysql
import sqlalchemy
import os

In [7]:
city_df = pd.read_csv("C:/Users/shrut/OneDrive/Documents/Data_Engineering_Pipelines/city_data.csv")

In [8]:
city_df.head()

,Unnamed: 0,city_id,city,country,country_code,region,elevation,city_latitude,city_longitude,population
0,0,Q64,Berlin,Germany,DE,Berlin,NaN,52.516667,13.383333,3664088
1,1,Q1055,Hamburg,Germany,DE,Hamburg,NaN,53.550000,10.000000,1852478
2,2,Q1726,Munich,Germany,DE,Bavaria,519.0,48.134520,11.571000,1488202
3,3,Q365,Cologne,Germany,DE,North Rhine-Westphalia,52.0,50.942222,6.957778,1083498
4,4,Q1794,Frankfurt am Main,Germany,DE,Hesse,112.0,50.113611,8.679722,764104

In [9]:
city_df.drop(columns = ["Unnamed: 0"], inplace = True)